<a href="https://colab.research.google.com/github/renatagsr/aprendizado_python/blob/master/Identificando_Valores_Duplicados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Lidando com Dados Duplicados

Ter dados duplicados pode ser um grande problema, pois eles ocupam mais espaço, necessitando maior poder computacional para erem processados de forma inútil, visto que a duplicidade de dados não da mais informações. Além disso o fato de ter mais dados do que o real, pode interferir na análise que será feita.

In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('https://www.dropbox.com/s/v0x8mbaygdqubli/contas_a_pagar.xlsx?dl=1')
df

   pagamento    valor  codigo_pagamento
0  imposto x   458.86      123456789012
1  imposto y   467.69      123456789012
2  imposto z    25.15      555444332221
3       agua   951.31      568754456745
4        luz  1548.25      546982454523
5   internet   798.99      364821542215
6  segurança  1439.54      546982454123
7  segurança  1439.54      546982454123
8        luz   147.45      546982454523

In [3]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8    False
dtype: bool

Esse método utilizado fornece informação para uma linha que é 100% igual a outra.

In [5]:
df.duplicated(subset='codigo_pagamento')

0    False
1     True
2    False
3    False
4    False
5    False
6    False
7     True
8     True
dtype: bool

Dessa forma identifica se dentro de uma coluna há o mesmo valor.

In [6]:
df.drop_duplicates(inplace=True)
df

   pagamento    valor  codigo_pagamento
0  imposto x   458.86      123456789012
1  imposto y   467.69      123456789012
2  imposto z    25.15      555444332221
3       agua   951.31      568754456745
4        luz  1548.25      546982454523
5   internet   798.99      364821542215
6  segurança  1439.54      546982454123
8        luz   147.45      546982454523

Excluiu a linha 7 que estava igual a linha 6.

In [8]:
df.drop_duplicates(subset = 'codigo_pagamento', inplace=True)
df

   pagamento    valor  codigo_pagamento
0  imposto x   458.86      123456789012
2  imposto z    25.15      555444332221
3       agua   951.31      568754456745
4        luz  1548.25      546982454523
5   internet   798.99      364821542215
6  segurança  1439.54      546982454123

Agora excluiu as linhas que possuiam algum valor duplicado e não que ela estava toda duplicada. Fez essa retirada porque havia código de pagamento repetido, isso poderia fazer com que houvesse o mesmo pagamento mais de uma vez e, assim, causando prejuízo.

O "inplace = True" é importante para que os valores sejam substituidos no data set também.

In [9]:
df['codigo_pagamento'].value_counts()

364821542215    1
555444332221    1
546982454523    1
568754456745    1
123456789012    1
546982454123    1
Name: codigo_pagamento, dtype: int64

Percebe-se que agora de fato tem apenas uma valor em cada código de pagamento.

Foi uma análise simples, mas que fez a retirada de 40% dos dados, que estavam duplicados, isso poderia causar um grande prejuízo, principalmente se fosse um conjunto de dados muito grande. Dessa forma, é possível ver a importância da visualização da ocorrência de dados duplicados, a fimd de evitar prejuízos que podem ser resolvidos de forma rápida e prática, com apenas algumas linhas de código.